{"modelTopology": {"keras_version": "2.1.6", "backend": "tensorflow", "model_config": {"config": [{"config": {"data_format": "channels_last", "use_bias": true, "activity_regularizer": null, "padding": "same", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "batch_input_shape": [null, 96, 96, 3], "strides": [1, 1], "name": "conv2d_1", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "kernel_size": [3, 3], "trainable": true, "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "filters": 32, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"gamma_regularizer": null, "beta_regularizer": null, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "scale": true, "name": "batch_normalization_1", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "trainable": true, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"data_format": "channels_last", "padding": "valid", "pool_size": [3, 3], "trainable": true, "name": "max_pooling2d_1", "strides": [3, 3]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_1", "seed": null, "noise_shape": null, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"data_format": "channels_last", "use_bias": true, "activity_regularizer": null, "padding": "same", "activation": "linear", "kernel_regularizer": null, "bias_constraint": null, "name": "conv2d_2", "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"gamma_regularizer": null, "beta_regularizer": null, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "scale": true, "name": "batch_normalization_2", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "trainable": true, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"data_format": "channels_last", "use_bias": true, "activity_regularizer": null, "padding": "same", "activation": "linear", "kernel_regularizer": null, "bias_constraint": null, "name": "conv2d_3", "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"gamma_regularizer": null, "beta_regularizer": null, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "scale": true, "name": "batch_normalization_3", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "trainable": true, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_2", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_2", "seed": null, "noise_shape": null, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"data_format": "channels_last", "use_bias": true, "activity_regularizer": null, "padding": "same", "activation": "linear", "kernel_regularizer": null, "bias_constraint": null, "name": "conv2d_4", "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 128, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation"}, {"config": {"gamma_regularizer": null, "beta_regularizer": null, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "scale": true, "name": "batch_normalization_4", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "trainable": true, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"data_format": "channels_last", "use_bias": true, "activity_regularizer": null, "padding": "same", "activation": "linear", "kernel_regularizer": null, "bias_constraint": null, "name": "conv2d_5", "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 128, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_5", "activation": "relu"}, "class_name": "Activation"}, {"config": {"gamma_regularizer": null, "beta_regularizer": null, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "scale": true, "name": "batch_normalization_5", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "trainable": true, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_3", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_3", "seed": null, "noise_shape": null, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "units": 1024, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "name": "dense_1", "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_6", "activation": "relu"}, "class_name": "Activation"}, {"config": {"gamma_regularizer": null, "beta_regularizer": null, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "scale": true, "name": "batch_normalization_6", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "trainable": true, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "dropout_4", "seed": null, "noise_shape": null, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "units": 2, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "name": "dense_2", "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_7", "activation": "sigmoid"}, "class_name": "Activation"}], "class_name": "Sequential"}, "training_config": {"loss": "binary_crossentropy", "sample_weight_mode": null, "loss_weights": null, "optimizer_config": {"config": {"beta_2": 0.9990000128746033, "decay": 9.999999747378752e-06, "beta_1": 0.8999999761581421, "amsgrad": false, "lr": 0.0010000000474974513, "epsilon": 1e-07}, "class_name": "Adam"}, "metrics": ["accuracy"]}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "batch_normalization_1/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_1/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_1/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_1/moving_variance", "shape": [32], "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"name": "batch_normalization_2/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_2/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_2/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_2/moving_variance", "shape": [64], "dtype": "float32"}]}, {"paths": ["group3-shard1of1"], "weights": [{"name": "batch_normalization_3/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_3/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_3/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_3/moving_variance", "shape": [64], "dtype": "float32"}]}, {"paths": ["group4-shard1of1"], "weights": [{"name": "batch_normalization_4/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_4/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_4/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_4/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group5-shard1of1"], "weights": [{"name": "batch_normalization_5/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_5/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_5/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_5/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group6-shard1of1"], "weights": [{"name": "batch_normalization_6/gamma", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_6/beta", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_6/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_6/moving_variance", "shape": [1024], "dtype": "float32"}]}, {"paths": ["group7-shard1of1"], "weights": [{"name": "conv2d_1/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [32], "dtype": "float32"}]}, {"paths": ["group8-shard1of1"], "weights": [{"name": "conv2d_2/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [64], "dtype": "float32"}]}, {"paths": ["group9-shard1of1"], "weights": [{"name": "conv2d_3/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_3/bias", "shape": [64], "dtype": "float32"}]}, {"paths": ["group10-shard1of1"], "weights": [{"name": "conv2d_4/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_4/bias", "shape": [128], "dtype": "float32"}]}, {"paths": ["group11-shard1of1"], "weights": [{"name": "conv2d_5/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_5/bias", "shape": [128], "dtype": "float32"}]}, {"paths": ["group12-shard1of9", "group12-shard2of9", "group12-shard3of9", "group12-shard4of9", "group12-shard5of9", "group12-shard6of9", "group12-shard7of9", "group12-shard8of9", "group12-shard9of9"], "weights": [{"name": "dense_1/kernel", "shape": [8192, 1024], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [1024], "dtype": "float32"}]}, {"paths": ["group13-shard1of1"], "weights": [{"name": "dense_2/kernel", "shape": [1024, 2], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [2], "dtype": "float32"}]}]}